# WallpaintColor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallPaint..::..WallpaintColor Property
WallPaint Class See Also
---
The property labeled "Color" from the "WallPaint" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WallpaintColor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallpaintColor As String
	Get
```

Visual C++
---
```text
public:
static property String^ WallpaintColor {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
# See Also
WallPaint Class
Autodesk.Revit.DB.Visual Namespace